[{"albumName":"11:11","artist":"Pinegrove","coverPath":"covers\\Pinegrove.png","coverURL":"http:\/\/coverartarchive.org\/release\/e49c9422-acdb-4003-b137-007886eec272\/31576867035.jpg","coverID":"31576867035","releaseid":"e49c9422-acdb-4003-b137-007886eec272","success":"yes","genre":"Rock","rating":"love","thoughts":"Look it's not my favorite pinegrove album but bc I love this band so much this album is also dear to me. I was kind of like eye-roll-y at first because it's so meta and so not subtle in its themes (climate crisis covid capitalism etc.) but ultimately it's so pinegrove at its core that I have to like it, although I accept a lot of people would not"},{"albumName":"19 MASTERS","artist":"Saya Gray","coverPath":"covers\\Saya Gray.png","coverURL":"http:\/\/coverartarchive.org\/release\/8e35b440-9aab-4e51-b809-f588a6556353\/32777362640.jpg","coverID":"32777362640","releaseid":"8e35b440-9aab-4e51-b809-f588a6556353","success":"yes","genre":"R&B, Pop","rating":"love","thoughts":"uhh don't judge the genres i copied pitchfork but anyways I disocvered Saya Graya back when she had only two songs on spotify and i listed to them on loop back to back. this was like two years ago and i'm so glad she finally dropped a full length project. I think the tracks I listened to had a kind of honest simplicity that gets lost a little on the album (in fact one of the tracks she completely removed from her page and only does like a small reference to in a different song on the album) and I think there are some moments that are a little too \"performance art-y\" for me. like this album is like if that cool theater kid that people actually respect dropped an album, where you can tell they're still a theater kid but it's good enough that you let it slide. also she is the alliteration queen! a little much sometimes but go off. mostly this album is really fresh in sound and creates this sort of dark swirly atmosphere that Gray pretty expertly explores and plays with and ur just along for the ride."},{"albumName":"2000","artist":"Joey Bada$$","coverPath":"covers\\Joey Bada$$.png","coverURL":"http:\/\/coverartarchive.org\/release\/1746c68a-5a0a-4eae-a4dc-b5496251a1d5\/33097118467.jpg","coverID":"33097118467","releaseid":"1746c68a-5a0a-4eae-a4dc-b5496251a1d5","success":"yes","genre":"Rap","rating":"eh","thoughts":"not very memorable, felt a little underwhelming. Joey Bada$$ has a nice flow and is a strong rapper but this album didn't really do it fo rme"},{"albumName":"777","artist":"Latto","coverPath":"covers\\Latto.png","coverURL":"http:\/\/coverartarchive.org\/release\/23190a48-48f7-40a2-b363-ae19a48902a9\/32079163644.jpg","coverID":"32079163644","releaseid":"23190a48-48f7-40a2-b363-ae19a48902a9","success":"yes","genre":"Rap","rating":"no.","thoughts":"So unimpressive lmao. Latto is only good at dropping the stray banger, and when she does it's a BANGER but this is an entire album of weak ass tracks. She's trying to be like more R&B I think? But that's not her niche and it shows. sowwyyyyy"},{"albumName":"<COPINGMECHANISM>","artist":"willow","coverPath":"covers\\willow.png","coverURL":"http:\/\/coverartarchive.org\/release\/502fd8da-3835-4dd5-8ef2-2f27ebba491c\/33219455485.jpg","coverID":"33219455485","releaseid":"502fd8da-3835-4dd5-8ef2-2f27ebba491c","success":"yes","genre":"Rock","rating":"fine","thoughts":"So on this project it feels like Willow is going a little more pop-y while still trying to retain elements of punk rock. I think she achievs this, but I think it was a faulty goal to begin with. her previous album 'lately I feel everything' was so good because it committed to the aesthetic completely, whereas on this one I felt a little underwhelmed by the stylistic choices. There are no like objectively bad tracks, and I thought all of them were pretty fun and well produced but re-introducing more digestible pop elements made the whole project feel a little bland to me. It feels like she's trying to find the middle ground between the really alty pop sound of her earlier stuff and the vibes on lately i feel everything, but I don't think she quite achieved it here."},{"albumName":"AMERICAN GURL","artist":"Kilo Kish","coverPath":"covers\\Kilo Kish.png","coverURL":"http:\/\/coverartarchive.org\/release\/0d8e19a5-e2af-4eed-8fd9-7ff80949da7f\/32078393721.jpg","coverID":"32078393721","releaseid":"0d8e19a5-e2af-4eed-8fd9-7ff80949da7f","success":"yes","genre":"Pop","rating":"love","thoughts":"Again I feel like Charli XCX is left irrelevant when we have artists like Kilo Kish coming onto the scene. Is this hyper pop? Idk. It feels like baby FKA Twigs but I think Kilo Kish definitely has her own sound and ethos while still settling comfortably into the direction that this style (whatever it is) is headed in. Not just settling comfotably but definitely propelling this type of sound forward. Really cool project"},{"albumName":"Adult Hits","artist":"Blinker","coverPath":"","coverURL":"","coverID":"","releaseid":"","success":"no","genre":"Rock","rating":"love","thoughts":"This album is funny without taking itself too seriously but pulls you in for very welcome moments of vulnerability at exactly the right moments. Adult Hits is a half hour of just hanging out with the band that is Blinker, it's their candid response when you ask them \"what's going on with u lately\" and lot of times throughout you're like \"yeah shit me too\" but ultimately, you just have a great time shooting the shit together. And you would, if you could hang out with them irl. you can trust my first hand experience."},{"albumName":"Anais Mitchell","artist":"Anais Mitchell","coverPath":"covers\\Anais Mitchell.png","coverURL":"http:\/\/coverartarchive.org\/release\/7eace8ed-912d-4579-933e-b79bc263609a\/30890996945.jpg","coverID":"30890996945","releaseid":"7eace8ed-912d-4579-933e-b79bc263609a","success":"yes","genre":"Folk","rating":"eh","thoughts":"I wasn't crazy about this project. I love hadestown and i think that Anais Mitchell's writing style is well suited to that longform narrative context because you see it on this album but without like clear cut central characters. It's just her telling stories in the form of folk songs lol idk i wasn't crazy about it. pitchfork loved it tho"},{"albumName":"Ants From Up There","artist":"Black Country, New Road","coverPath":"covers\\Black Country, New Road.png","coverURL":"http:\/\/coverartarchive.org\/release\/890a37d7-79f8-4560-b294-cda2ef5d1998\/34169754176.jpg","coverID":"34169754176","releaseid":"890a37d7-79f8-4560-b294-cda2ef5d1998","success":"yes","genre":"Folk\/Acoustic","rating":"like","thoughts":"Some of the instrumentation on this album reminded me of Illinoise era sufjan stevens which was fun. A very solid folk-y album. I didn't save any tracks but I had a good time listening."},{"albumName":"Asphalt Meadows","artist":"Death Cab For Cutie","coverPath":"covers\\Death Cab For Cutie.png","coverURL":"http:\/\/coverartarchive.org\/release\/c1881af3-292d-48c6-8365-7e8a419829be\/32502599799.jpg","coverID":"32502599799","releaseid":"c1881af3-292d-48c6-8365-7e8a419829be","success":"yes","genre":"Rock","rating":"","thoughts":"Ok people loved this album and hailed it as the return of DCFC and idk if it's the fact that I am just not the same person I was when I had a massive Death Cab phase or what, but this album was really underwhelming. Honestly maybe it is just me. It probably is. But yeah was underwhelmed by this."},{"albumName":"BIEN O MAL","artist":"TRUENO","coverPath":"covers\\TRUENO.png","coverURL":"http:\/\/coverartarchive.org\/release\/e5418e67-6a5f-4b42-a500-6ef5a439cd2b\/33562548634.png","coverID":"33562548634","releaseid":"e5418e67-6a5f-4b42-a500-6ef5a439cd2b","success":"yes","genre":"Rap, Global","rating":"like","thoughts":"I don't know what he's saying like 70% of the time but I fucking love this mans flow. I think if I were argentinian a lot of this album would have hit a lot harder but there are some definite bangers on here."},{"albumName":"Big Time","artist":"Angel Olsen","coverPath":"covers\\Angel Olsen.png","coverURL":"http:\/\/coverartarchive.org\/release\/13a592f3-8dab-4f87-afbb-5c36f5d79863\/32720035638.jpg","coverID":"32720035638","releaseid":"13a592f3-8dab-4f87-afbb-5c36f5d79863","success":"yes","genre":"Folk","rating":"like","thoughts":"I don't think this is the kind of music I would listen to regularly or apart from a very specific moment that called for it, but boy when that specific moment comes this album will do the goddamn trick. Big Time is dreamy, folky and reflective. It's the time of music that is more about creating colors and environments than it is about delivering a message or nailing down a theme. I'm glad I gave it a listen and will have it in my back pocket for when I'm walking through the forest or tripping shrooms"},{"albumName":"Blue Rev","artist":"Alvvays","coverPath":"covers\\Alvvays.png","coverURL":"","coverID":"","releaseid":"d68e4eff-c476-4e21-a5d0-b68608653eb9","success":"yes - manual","genre":"Rock","rating":"love","thoughts":""},{"albumName":"Bummer Year","artist":"Good Looks","coverPath":"covers\\Good Looks.png","coverURL":"http:\/\/coverartarchive.org\/release\/275a9469-6e25-4379-b6a5-e765d2f5ae2f\/33890113891.jpg","coverID":"33890113891","releaseid":"275a9469-6e25-4379-b6a5-e765d2f5ae2f","success":"yes","genre":"Rock","rating":"fine","thoughts":"A fun rock\/alt album with hints of the texas roots of the band members but ultimately not super memorable and no track stood out"},{"albumName":"CAPRISONGS","artist":"FKA Twigs","coverPath":"covers\\FKA Twigs.png","coverURL":"http:\/\/coverartarchive.org\/release\/333373c0-724b-4b2c-8f33-e2dc073a8994\/31396746399.jpg","coverID":"31396746399","releaseid":"333373c0-724b-4b2c-8f33-e2dc073a8994","success":"yes","genre":"Pop","rating":"love","thoughts":"I loved this album even tho it was kinda fuckin weird. I think it marks a really tangible and intentional shift in twiggys sound towards more hyper pop type shit, and she executes it perfectly."},{"albumName":"Cleanse","artist":"Joywave","coverPath":"covers\\Joywave.png","coverURL":"http:\/\/coverartarchive.org\/release\/1ff35ee6-a833-4186-a662-9ef12289476e\/31707437775.jpg","coverID":"31707437775","releaseid":"1ff35ee6-a833-4186-a662-9ef12289476e","success":"yes","genre":"Pop","rating":"fine","thoughts":"a fun dance pop album. Miles better than the Wombats shit and similar vibe"},{"albumName":"Crash","artist":"Charli XCX","coverPath":"covers\\Charli XCX.png","coverURL":"","coverID":"","releaseid":"51539815-a0e1-41e4-b3c6-46d8766bef50","success":"yes - manual","genre":"Pop","rating":"love","thoughts":"Look I had to come back and edit this review that was originally SCATHING but I've actually come to love this album. I think I had too many rigid expectations about charli going into this, especially as someone who has never even fucked with her that heavy. Ultimately this album sets about to be a classic pop album, and for what it sets out to do it absolutely achieves it. So what if it doesn't fufill the hyper-pop fantasy of my dreams. It's fun as fuck."},{"albumName":"DECIDE","artist":"Djo","coverPath":"covers\\Djo.png","coverURL":"http:\/\/coverartarchive.org\/release\/14fb2b78-9625-44b1-9f42-861950e088b6\/33175960617.jpg","coverID":"33175960617","releaseid":"14fb2b78-9625-44b1-9f42-861950e088b6","success":"yes","genre":"Pop","rating":"love","thoughts":"This album is so much fun and it is made even more fun by the fact that it's that boy from stranger things??? okay go off joe keery"},{"albumName":"Dance Fever","artist":"Florence + The Machine","coverPath":"","coverURL":"covers\\Florence and the Machine.png","coverID":"","releaseid":"6b30ace9-882b-4481-abff-487ac2368f45","success":"yes - manual","genre":"Rock","rating":"eh","thoughts":"Honestly very forgettable. I feel like florence found her niche with dog days like it worked for that track but this album is just TOO florence and the machine for me you know"},{"albumName":"Denim & Rhinestones","artist":"Carrie Underwood","coverPath":"covers\\Carrie Underwood.png","coverURL":"http:\/\/coverartarchive.org\/release\/608e6a41-65e1-4d38-8782-48f9f3592dda\/32312476184.jpg","coverID":"32312476184","releaseid":"608e6a41-65e1-4d38-8782-48f9f3592dda","success":"yes","genre":"Global, Pop","rating":"love","thoughts":"Carrie Underwood is how you age when you are unproblematic. I fucking love this album. Like Ms. Underwood knows what she is here to do and she did that. It's not revolutionary, it's not ground breaking, it's not even very reflective or thoughtful but like goddamn. It's just so classic. It's like a tasteful invocation of 2010's country-pop. Also I just love Carrie Underwoods song writing as a standard for pop music. Like all the lyrics are accessible but she still has some bars in there, every single hook and chorus is catchy as fuck....It's simply everything I would have wanted from the first Carrie Underwood album I've listened to in years. Avril Lavigne take notes. I feel like Carrie Underwood is like the epitome of aging gracefully. This album is still her classic style and sound but it's obviously matured with her (are you listening avril). Like Poor Everybody Else??? hello?? That is where our car smashing heroine from Before He Cheats is now. She is thriving. So is Carrie."},{"albumName":"Dirt Femme","artist":"Tove Lo","coverPath":"covers\\Tove Lo.png","coverURL":"http:\/\/coverartarchive.org\/release\/ee3cf460-c4c1-41b6-8e79-954540b16841\/33937403392.jpg","coverID":"33937403392","releaseid":"ee3cf460-c4c1-41b6-8e79-954540b16841","success":"yes","genre":"Pop","rating":"love","thoughts":"Why have I been sleeping on Tove Lo? Like I guess I haven't obviously we all know her hits but I think I never took her seriously as an artist but wow ya this album is from a bitch who knows what she is doing. Not only is it just like bop after bop, but it is actually a really cohesive exploration of feminitiy and sexuality done in a tasteful and not overly-kitchy way. Also she has like one of the only sex songs of this year that didn't make me cringe. go off queen (okay i relistned to the sex song which is Pineapple Slice and yes the lyrics are kind of cringey but the beat is so good and the melody is so catchy that like i accept it i'll let the pineapple reference slide this time)"},{"albumName":"Dragon New Warm Mountain I Believe in You","artist":"Big Thief","coverPath":"covers\\Big Thief.png","coverURL":"http:\/\/coverartarchive.org\/release\/a64d764d-deca-4231-bffe-bcaf40fb1943\/34229330075.jpg","coverID":"34229330075","releaseid":"a64d764d-deca-4231-bffe-bcaf40fb1943","success":"yes","genre":"Folk\/Acoustic","rating":"like","thoughts":"this album feels like a hug and the crunch of fall leaves under your shoes at the same time."},{"albumName":"Emotional Creature","artist":"Beach Bunny","coverPath":"covers\\Beach Bunny.png","coverURL":"http:\/\/coverartarchive.org\/release\/20d97980-59fe-4f8f-86ce-a6ed1a7b9984\/33141712998.png","coverID":"33141712998","releaseid":"20d97980-59fe-4f8f-86ce-a6ed1a7b9984","success":"yes","genre":"Rock","rating":"eh","thoughts":"I guess keeping with the theme of disappointing follow up projects: honestly I'm not heartbroken over this album. It does feel like this is a fair pivot for Beach Bunny to take after the grunge pop beach vibes of Honeymoon. This album is more dialed down in that it will lack many of the solo bedroom dance parties that Honeymoon had afforded me, and I think for that reason it resonates less with me. I think without the energy of Honeymoon, the simple teenage-y lyrics surrounding angst and heartbreak that exist in both records are less tolerable for me on Emotional Creature. That said, it still very much feels like Beach Bunny's vibe, style, ethos, etc. So while I respect the project and the stylistic direction they took with it, it's just not for me"},{"albumName":"Few Good Things","artist":"Saba","coverPath":"covers\\Saba.png","coverURL":"http:\/\/coverartarchive.org\/release\/96697de1-aed6-4465-92d7-d8de2ed4e208\/31647115084.jpg","coverID":"31647115084","releaseid":"96697de1-aed6-4465-92d7-d8de2ed4e208","success":"yes","genre":"Rap","rating":"love","thoughts":"Love this album. I think the over arching themes are really well woven into each track. I, like a dumbass, read the pitchfork review before writing this, which criticized all of the style bending Saba does but I honestly didn't mind it. Maybe it was an 'imitation' but I think Saba used it to his advantage to change the tone of certain tracks to match their thematic core. A song about 'survivors guilt' undercut with the aggressive throaty tone Saba uses elevates and colors the ideas presented in a really interesting way. That said, I have to agree with Pitchfork that the best standout tracks are always when Saba leans into his chill, easy, laidback flow with the beats to match. But that said, I appreciate all of the turns and bends Saba did on this project and I honestly think it only positively contributed to the album as a whole and to the ideas Saba is trying to portray through the project itself, rather than through standalone tracks"},{"albumName":"Fix Yourself Not The World","artist":"The Wombats","coverPath":"covers\\The Wombats.png","coverURL":"http:\/\/coverartarchive.org\/release\/fc103e39-06c5-4197-9fe6-39df65106b3f\/30404501126.png","coverID":"30404501126","releaseid":"fc103e39-06c5-4197-9fe6-39df65106b3f","success":"yes","genre":"Pop","rating":"fine","thoughts":"Just the same thing over and over. It was fun but also I don’t like this genre of indie pop walk the moon type shit. Idk it was fine."},{"albumName":"From 2 to 3","artist":"Peach Pit","coverPath":"covers\\Peach Pit.png","coverURL":"http:\/\/coverartarchive.org\/release\/790b0838-2d47-4b9e-b2b7-07f8519eb00c\/31914624460.jpg","coverID":"31914624460","releaseid":"790b0838-2d47-4b9e-b2b7-07f8519eb00c","success":"yes","genre":"Rock","rating":"love","thoughts":"I've seen people say this is Peach Pit's best album but for me it defintiely pales in comparison to a lot of their other releases. They go for like a softer groovier vibe here and I miss a lot of the gnarly-ness of some of their previous works. It's a great album to throw on whenever, but nothing really stood out to me and I wouldn't see myself replacing any of my classic peach pit with faves with any of the tracks on this album any time soon"},{"albumName":"From a Birds Eye View","artist":"Cordae","coverPath":"covers\\Cordae.png","coverURL":"http:\/\/coverartarchive.org\/release\/f3201b7e-3c82-4eb6-9499-f63f4b3ee495\/31570572252.jpg","coverID":"31570572252","releaseid":"f3201b7e-3c82-4eb6-9499-f63f4b3ee495","success":"yes","genre":"Rap","rating":"like","thoughts":"Very kota the friend vibes. I think emblematic of a general shift in rap music, so I wouldn't call it revolutionary but definitely playing a role in said shift. I like the highs and lows mood wise, but never loses the groove. I like this album as an exploration of joy and grief, I think the juxtaposition really works"},{"albumName":"GEMINI RIGHTS","artist":"Steve Lacy","coverPath":"covers\\Steve Lacy.png","coverURL":"http:\/\/coverartarchive.org\/release\/6d50b672-4f8e-4b7a-917b-1ded22808632\/33115391771.jpg","coverID":"33115391771","releaseid":"6d50b672-4f8e-4b7a-917b-1ded22808632","success":"yes","genre":"Pop","rating":"love","thoughts":"Love this album!! It feels very classic Steve Lacy. I think he is settling into his sound\/brand with this album which is nice because I think this style is in very high demand and when you execute it this flawlessly it's bound to be ahit"},{"albumName":"God Save The Animals","artist":"Alex G","coverPath":"covers\\Alex G.png","coverURL":"http:\/\/coverartarchive.org\/release\/0c889c27-2492-46ca-82c2-d93b536d54ec\/33661669799.png","coverID":"33661669799","releaseid":"0c889c27-2492-46ca-82c2-d93b536d54ec","success":"yes","genre":"Experimental","rating":"no.","thoughts":"not for me"},{"albumName":"Harry's House","artist":"Harry Styles","coverPath":"covers\\Harry Styles.png","coverURL":"","coverID":"","releaseid":"b40e37b2-fe5f-47ac-947b-7c0c6bc67610","success":"yes - manual","genre":"Pop","rating":"like","thoughts":"Might be a hot take but I like this album, it's groovy. I like anthony fantano's review of this being very Ezra Koenig wanna be, I think he mentioned something like \"soft groovy vibes that finds ways to sprinkle his privelege into the lyrics\" lol which I agree with. The production is great, but that said, I wonder how much if this album is actually harry styles. Like he had a lot of creative input and even produciton credits from a lot of great producers (Quincy jones??) and I honestly don't give him enough credit as a figure to have the mind needed to pull off some of the grooviest bits of this album. I think this shows in like the very weak lyrical writing at a lot of points in the album, where it's like when it's Harry's turn to be Harry we're just kind of like alright harold you can pass it back to quincy whenever. But yeah it's not a bad album at all. I saved a good chunk of songs and they will probably make it on to many a playlist."},{"albumName":"Hell on Church Street","artist":"Punch Brothers","coverPath":"covers\\Punch Brothers.png","coverURL":"http:\/\/coverartarchive.org\/release\/6aa64694-acf7-4e53-9fe3-d705b6f370a6\/30536512229.jpg","coverID":"30536512229","releaseid":"6aa64694-acf7-4e53-9fe3-d705b6f370a6","success":"yes","genre":"Global, Folk","rating":"love","thoughts":"This is like what I needed Mumford and sons to be. So many stank faces. Such a great Americana\/folk album m"},{"albumName":"Hold the Girl","artist":"Rina Sawayama","coverPath":"covers\\Rina Sawayama.png","coverURL":"http:\/\/coverartarchive.org\/release\/57195193-b50e-4c41-9e63-e376eaa3c1a6\/33591106392.jpg","coverID":"33591106392","releaseid":"57195193-b50e-4c41-9e63-e376eaa3c1a6","success":"yes","genre":"Pop","rating":"like","thoughts":"This album was produced by the gods. Like seriously the production is insane maybe I was just listening to it very loud on my headphones but wow. There are also a lot of bangers. A couple of duds but in general I think this album deserves a lot of traction as I think it is a v important contribution to the modern pop genre!"},{"albumName":"Holy Fvck","artist":"Demi Lovato","coverPath":"covers\\Demi Lovato.png","coverURL":"http:\/\/coverartarchive.org\/release\/f910478b-594b-4b5e-b36e-cd618ca59a6a\/33341799088.jpg","coverID":"33341799088","releaseid":"f910478b-594b-4b5e-b36e-cd618ca59a6a","success":"yes","genre":"Rock","rating":"like","thoughts":"This is the genre that Demi Lovato needs to be existing in. This is like what Miley Cyrus less successfully attempted to. I can tell that this was a really cathartic project for Demi, and I think the emotional value that it had for them is really apparent on the album, and what makes it work. I don't think the album is anything spectacular or life changing, but it really does just work so well for what it's meaning to do. Demi's effortlessly soaring belts work so much better in these punk rock angst anthems than in any other pop tinged track they've released before. The low light of the album was Feed, where they unironically turn the two wolves meme into a song and I just couldn't like take it seriously enough. But yeah it's a really strong project, I'm really happy for Demi as I think they've slotted their niche here."},{"albumName":"How It Ends","artist":"Toledo","coverPath":"covers\\Toledo.png","coverURL":"http:\/\/coverartarchive.org\/release\/4226cfb3-0fe1-4458-9ada-9ee52421e5eb\/33732054918.jpg","coverID":"33732054918","releaseid":"4226cfb3-0fe1-4458-9ada-9ee52421e5eb","success":"yes","genre":"Rock","rating":"love","thoughts":"I stumbled upon this album because Tiny Habits posted a cover of flake that absolutely blew my mind and while I honestly prefer the Tiny Habits this is still a really sweet and well done soft rock album. I'm happy I found it, even if there aren't a ton of standout tracks it's like a really nice vibe"},{"albumName":"Hypnos","artist":"Ravyn Lenae","coverPath":"covers\\Ravyn Lenae.png","coverURL":"http:\/\/coverartarchive.org\/release\/b80aa1df-621b-4b91-93d1-f2a295c0e25d\/32568565167.jpg","coverID":"32568565167","releaseid":"b80aa1df-621b-4b91-93d1-f2a295c0e25d","success":"yes","genre":"R&B","rating":"","thoughts":""},{"albumName":"I Love You Jennifer B","artist":"Jockstrap","coverPath":"covers\\Jockstrap.png","coverURL":"http:\/\/coverartarchive.org\/release\/a1b9c491-ff74-4e81-936b-bdb5f8a42a0b\/33559425170.jpg","coverID":"33559425170","releaseid":"a1b9c491-ff74-4e81-936b-bdb5f8a42a0b","success":"yes","genre":"Dance\/Electronic","rating":"love","thoughts":"God there are some tracks on this album that are just like brain explode. I wish I could have given it a bit more attention because I think some of the gentler tracks don't really hit without actually thinking about the themes and ideas being expressed but yeah I love what Jockstrap is doing. I'm a big fan of this like EDM pop crossover in a way that isn't even hyperpop per se, but is actually just two ideas co-existing (i.e., the electronic production side and then the sung, melodic and lyrical side). Idk if this makes sense. doesn't matter. good album"},{"albumName":"Ivory","artist":"Omar Apollo","coverPath":"covers\\Omar Apollo.png","coverURL":"http:\/\/coverartarchive.org\/release\/96b75672-bc22-44b6-b5a3-2ee8c230c3f0\/32558896694.jpg","coverID":"32558896694","releaseid":"96b75672-bc22-44b6-b5a3-2ee8c230c3f0","success":"yes","genre":"Pop","rating":"love","thoughts":"A very classic omar apollo album. In that sense i don't think he went too far out of his comfort zone, maybe save for the fact that there are more senstivie and thoughtful tracks on this album then straight up bops, which is what i'm used to from omar apollo. There isn't much to say, he's a really fantastic up and coming artist and this just feels like the natural progression in his development as a prominent figure in alt pop"},{"albumName":"LP3","artist":"Hippo Campus","coverPath":"covers\\Hippo Campus.png","coverURL":"http:\/\/coverartarchive.org\/release\/443535d8-26ea-4a48-b73c-f507dc1b016c\/32250153571.jpg","coverID":"32250153571","releaseid":"443535d8-26ea-4a48-b73c-f507dc1b016c","success":"yes","genre":"Rock","rating":"like","thoughts":"It's a fun album but nothing ground breaking."},{"albumName":"La Mida","artist":"Anna Andreu","coverPath":"","coverURL":"","coverID":"","releaseid":"505d5574-036d-474e-813e-5caaa04d544a","success":"no","genre":"Folk\/Acoustic","rating":"love","thoughts":"Fun fact is that I discovered this artist on christmas even in pl. catalunya, she was giving a free concert put on by the ajuntament and it was just her with her guitar and her girlfriend on the drums and doing backing vocals. And truthfully I had my expectations low, because catalan music can be pretty hit or miss but she got my attention that night and i looked her up later and damn is this album beautiful. It really is just her and her guitar almost the whole time but it creates a kind of intimacy that when coupled with some really beautiful lyrics makes me feel like i'm back in pl catalunya on that night but it's a private concert."},{"albumName":"Las Ruinas","artist":"Rico Nasty","coverPath":"covers\\Rico Nasty.png","coverURL":"http:\/\/coverartarchive.org\/release\/2b9205d8-052e-46aa-86d2-7ea25a7f2c5c\/33096908270.jpg","coverID":"33096908270","releaseid":"2b9205d8-052e-46aa-86d2-7ea25a7f2c5c","success":"yes","genre":"Rap","rating":"like","thoughts":"So I learned that Rico Nasty has explicitly been branding this project as a mixtape and not an album, and I think that makes a lot of sense. The project is really distinctly split in two, with the first half being Rico's more classic \"rage rap\" style, and the second half being a complete 180 into R&B style musical and lyrical softness. I'm not sure if the second half of the album really does it for me, although I can appreciate and empathize with some of the more intimate themes rico tries to explore. I think as a mixtape it makes sense, not only given the kind of whiplash caused by the abrupt change in style halfway through, but also because I think Rico is, smartly, using this as a chance to explore her own limits as an artist without the pressure of a neatly polished album. I think for an exploratory, experimental mixtape that for at least half of the time feels like Rico just flexing and having fun in her element, it does what it needs to and spits out some solid bangers in the mean time"},{"albumName":"Laurel Hell","artist":"Mitski","coverPath":"covers\\Mitski.png","coverURL":"http:\/\/coverartarchive.org\/release\/8f1001f7-5578-40ba-8d80-4fe9d682a36a\/32567201236.jpg","coverID":"32567201236","releaseid":"8f1001f7-5578-40ba-8d80-4fe9d682a36a","success":"yes - manual","genre":"Pop","rating":"love","thoughts":"Wow this album is everything to me. idk how mitski manages to like capture such fundamental human feelings in simple catch refrains. Also i love the 80s vibe. idk i just love this album its very cathartic"},{"albumName":"Louie","artist":"Kenny Beats","coverPath":"covers\\Kenny Beats.png","coverURL":"http:\/\/coverartarchive.org\/release\/8c363263-533c-46d7-bdcd-42d130b70019\/33452991308.png","coverID":"33452991308","releaseid":"8c363263-533c-46d7-bdcd-42d130b70019","success":"yes","genre":"Hip-Hop","rating":"love","thoughts":"I like this album for the same reason I like Kenny Beats. Kenny Beats is like for all intents and purposes a simple standard white dude. Like he's not particularly charismatic or charming but there is just something about him that makes me fucking love that dude, and this is even aside of the fact that he is one of the best producers of our generation. This album is the same vibes. There aren't a lot of bells and whistles to it but there's just so much heart and fuzziness and so much of Kenny himself in it that without even realizing why or what song you're on or WITHOUT EVEN STANK FACING you're like \"damn you know what? I really fuck with this.\" That's how I feel about this album. I also feel weirdly proud of Kenny Beats for dropping this stand alone project after so many collabs. And it was awesome to hear all of the little cameos from his other artists friends and collaborators :')"},{"albumName":"Love Sux","artist":"Avril Lavigne","coverPath":"covers\\Avril Lavigne.png","coverURL":"http:\/\/coverartarchive.org\/release\/65a4a2f5-1931-43d3-92aa-7c90f20190c8\/31464673650.jpg","coverID":"31464673650","releaseid":"65a4a2f5-1931-43d3-92aa-7c90f20190c8","success":"yes","genre":"Rock","rating":"no.","thoughts":"girl grow up"},{"albumName":"Luv 4 Rent","artist":"Smino","coverPath":"covers\\Smino.png","coverURL":"http:\/\/coverartarchive.org\/release\/da207140-5e78-4816-91a6-433aad64b9da\/33943488598.jpg","coverID":"33943488598","releaseid":"da207140-5e78-4816-91a6-433aad64b9da","success":"yes","genre":"R&B, Rap","rating":"love","thoughts":"I said this on my insta, but Smi set a really high bar for himself. His first album, blkswn is just an immaculate project. it is criminally good for a breakout album. His second album NOIR like didn't wow me at first but somewhere between when it came out and the last year I came to the conclusion that is actually genius and the perfect follow up to blkswn. Given that specific context, this album definitely did disapoint me on first listen. Don't get me wrong I think it's really good. Like if I was just discovering Smino with this album I would be like \"holy shit this is nice\". But for his third project that spent 3 years in the works, I think I expected more. The production and vocals are amazing, but neither are just quite as creative as they were on blkswn or NOIR. I use the term \"settle into their sound\" a lot to describe when a (usually newer) artist really finds their stylistic niche, and i'm tempted to use it again here-- this album is very smino-y and it sits right in the pocket of the sound he's created for himself. The problem is, Smino came out of the gate with such a clear and dynamic create vision that he's not an artist I want to be settling into anything, especially at this point in his career. To Smino's credit, the sound and style that he basically pioneered has become so popular these days that it's hard to stand out, but I honestly believed he could do it and in that sense, I'm let down. But I don't want this to distract from the fact that this is ultimately a really awesome album and I have been listening to it non stop. If you take it at face value it's definitely one of the best R&B\/hip hop albums of this year. But if someone asks me to send them some Smino, this will probably be the last project of his I'll reach for."},{"albumName":"MATRIARCHY NOW","artist":"Pussy Riot","coverPath":"covers\\Pussy Riot.png","coverURL":"http:\/\/coverartarchive.org\/release\/df17c3df-126b-4244-b512-7cf51e5eae3e\/33244071384.jpg","coverID":"33244071384","releaseid":"df17c3df-126b-4244-b512-7cf51e5eae3e","success":"yes","genre":"Pop","rating":"no.","thoughts":"It's like kinda fun I guess but also so weirdly hyper sexual at times and then also kinda bland so i guess it's not that fun"},{"albumName":"MOTOMAMI","artist":"Rosalia","coverPath":"covers\\Rosalia.png","coverURL":"http:\/\/coverartarchive.org\/release\/5e437206-54c0-4313-9084-5da728933d2a\/31637397904.jpg","coverID":"31637397904","releaseid":"5e437206-54c0-4313-9084-5da728933d2a","success":"yes","genre":"Global","rating":"love","thoughts":"This is such a natural progression for Rosalia after EMQ. This album is her flexing her range without sacrificing the stylistic roots that made everyone fall in love with her."},{"albumName":"MUNA","artist":"MUNA","coverPath":"covers\\MUNA.png","coverURL":"http:\/\/coverartarchive.org\/release\/80037d4c-1af6-4847-be88-b97b7d1a02a2\/31991740079.jpg","coverID":"31991740079","releaseid":"80037d4c-1af6-4847-be88-b97b7d1a02a2","success":"yes","genre":"Pop","rating":"like","thoughts":"Production was amazing but holy shit I hate this groups songwriting style. The lyrics were so terrible I was cringing all the way through what I want. Thankfully it was only on a couple of tracks that the lyrics were so bad it was distracting. To be fair I am such a snob about lyrics and I recognize that. I also recognize that this is a really fun dance-y, phoebe-bridgers-endorsed album, and that it is kind of the whole point of the pop genre to make music that is easily accessible and not \"sit-really-hard-and-reflect\" type tunes. MUNA the album is straightforward in its themes and while it's not my cup of tea I think there's a lot of room to excuse it in the name of the genre and style that MUNA the band are going after"},{"albumName":"Mahal","artist":"Toro y Moi","coverPath":"covers\\Toro y Moi.png","coverURL":"http:\/\/coverartarchive.org\/release\/11ab45df-ee87-4785-8dde-a317b180c9fe\/31568155367.jpg","coverID":"31568155367","releaseid":"11ab45df-ee87-4785-8dde-a317b180c9fe","success":"yes","genre":"Jazz\/Funk","rating":"love","thoughts":"I love this album. I think Toro y Moi has honed in on such a specific style and sound. I'm not too famliar w his work so I'm not sure how much of this is a departure and\/or evolution from past projects but whether this is somewhere he's recently landed or this is a style he's been been sharpening for a while, it seems obvious on this album that he is really comfortable in the stylistic space he's created for himself. Every track is like \"cozy groovy\", is how I would describe it. Sick album"},{"albumName":"Melt My Eyez See your Future","artist":"Denzel Curry","coverPath":"covers\\Denzel Curry.png","coverURL":"http:\/\/coverartarchive.org\/release\/29f25100-8f1c-48d0-bd85-6fb1ca85c6e9\/32075669978.jpg","coverID":"32075669978","releaseid":"29f25100-8f1c-48d0-bd85-6fb1ca85c6e9","success":"yes","genre":"Rap","rating":"love","thoughts":"I loved this album. It's such a cohesive project and Denzel's flow is one of my faves in the game rn. Huge fan"},{"albumName":"Memo","artist":"Kota the Friend","coverPath":"covers\\Kota the Friend.png","coverURL":"http:\/\/coverartarchive.org\/release\/d72c8550-2032-498a-9294-d2b72ffa42c5\/33026994262.jpg","coverID":"33026994262","releaseid":"d72c8550-2032-498a-9294-d2b72ffa42c5","success":"yes","genre":"Rap","rating":"like","thoughts":"Don't get me wrong this is a good album. Kota takes a more gospel inspired turn than his previous lo-fi chill-wave type projects. My issue is that I don't feel like it's such a revolutionary direction that it makes me feel anything special for this album. It is definitely a good one to have saved and I can see myself throwing it on in a lot of different situations, but I don't really see it sticking with me beyond something to meet a specific vibe and have on in the background"},{"albumName":"Mr. Morale & The Big Steppers","artist":"Kendrick Lamar","coverPath":"covers\\Kendrick Lamar.png","coverURL":"http:\/\/coverartarchive.org\/release\/e30c5440-4974-47cd-8275-5a6f104bb698\/32652649838.jpg","coverID":"32652649838","releaseid":"e30c5440-4974-47cd-8275-5a6f104bb698","success":"yes","genre":"Rap","rating":"love","thoughts":"SPEAKING OF HOT TAKES i'm gonna make some enemies by really championing this Kendrick album. I have so much to say about it. In an interview Kendrick says this is his most \"present\" album which I think is really tangible theme, despite how much of his tracks talk about his past. So many tracks for me are about the question of like \"How do these things affect me now, who am I now, what is my life now as a consequence of everything that has happened before me or might happen in the future.\" Obviously there is a lot to talk about re: auntie diaries, but the only thing I push for with this album is recognizing the humanity of it, and stripping away expectations of Kendrick as an artist or a celebrity. Obviously that is practically impossible in any real sense, but for the sake of listening to an album, of listening to this dudes stories and thoughts and like what he is REALLY trying to say and express, I think it's the only way to really interact with the album. It's just so fucking vulnerable and I think that however you feel about the dude or the songs, the levle of intimacy he's able to achieve with the album is worth respecting, and for me is what makes it one of my favorite releases of the year"},{"albumName":"Multitude","artist":"Stromae","coverPath":"covers\\Stromae.png","coverURL":"http:\/\/coverartarchive.org\/release\/78ff42d3-cb7b-416b-b3d1-a3f0535468af\/32338725554.jpg","coverID":"32338725554","releaseid":"78ff42d3-cb7b-416b-b3d1-a3f0535468af","success":"yes","genre":"Global","rating":"love","thoughts":""},{"albumName":"My Boy","artist":"Marlon Williams","coverPath":"covers\\Marlon Williams.png","coverURL":"http:\/\/coverartarchive.org\/release\/9d664bf1-80e1-433c-9e1c-f3c8ed6b9ba8\/32446617594.jpg","coverID":"32446617594","releaseid":"9d664bf1-80e1-433c-9e1c-f3c8ed6b9ba8","success":"yes","genre":"Folk\/Acoustic","rating":"fine","thoughts":"I can't appreciate this but it's just not my jam. Some fun tracks tho"},{"albumName":"NO THANK YOU","artist":"Little Simz","coverPath":"covers\\Little Simz.png","coverURL":"http:\/\/coverartarchive.org\/release\/f8d3ed4c-6bd1-429e-a740-2ea4e644cb98\/34526044405.jpg","coverID":"34526044405","releaseid":"f8d3ed4c-6bd1-429e-a740-2ea4e644cb98","success":"yes","genre":"Rap","rating":"love","thoughts":"I love that Little Simz leaned into a more acoustic sound on this. Like the gospel choir, the orchestral bits, even the mixing has that \"in the studio' feel. Which I think works on a project where it feels like Simz is just kinda of riffing on a lot of ideas. I mean it's a 10 track album that's almost an hour long so a lot of the tracks have that rambly feel to them, but I think Simz is such a strong rapper that she really makes it work where other times the same trick pulled by weaker rappers just comes off as like annoying. like shut up already. but i could listen to little simz going off over the same beat forever"},{"albumName":"NOT TiGHT","artist":"DOMi & JD BECK","coverPath":"covers\\DOMi & JD BECK.png","coverURL":"http:\/\/coverartarchive.org\/release\/5daa340c-bd2d-4e91-88b5-b9419dc68745\/32860885440.jpg","coverID":"32860885440","releaseid":"5daa340c-bd2d-4e91-88b5-b9419dc68745","success":"yes","genre":"Jazz\/Funk","rating":"love","thoughts":"love this album. Exactly what I think I was hoping for when I first heard of the Gen Z prodigal jazz masterminds that are DOMi and JD Beck. I think they did a great job of flexing their technical and theoretical chops while still making a jazz fusion album that was accessible and has so much replay value. I've been listening to this album nonstop for the last week."},{"albumName":"Natural Brown Prom Queen","artist":"Sudan Archives","coverPath":"covers\\Sudan Archives.png","coverURL":"http:\/\/coverartarchive.org\/release\/4cc8260e-519c-4168-bd51-0f9d3490d209\/33886021768.jpg","coverID":"33886021768","releaseid":"4cc8260e-519c-4168-bd51-0f9d3490d209","success":"yes","genre":"R&B, Pop","rating":"like","thoughts":"this album didn't hook me even tho pitchfork loved it, but I think there are some really cool tracks and ideas. The one that is so blatantly about sex kinda made me uncomfy tho lmao"},{"albumName":"No Rules Sandy","artist":"Sylvan Esso","coverPath":"covers\\Sylvan Esso.png","coverURL":"http:\/\/coverartarchive.org\/release\/1e0b4166-26b2-4820-b87e-71427d32d1e5\/33292070633.jpg","coverID":"33292070633","releaseid":"1e0b4166-26b2-4820-b87e-71427d32d1e5","success":"yes","genre":"Dance\/Electronic","rating":"love","thoughts":"I don't even know why this Sylvan Esso album is resonating with me so much I just fucking love it. Their last couple of albums have left me a little underwhelmed but I feel like this album they are finally finding their groove again. It's the perfect amount of weird, experimental, sentimental, and introspective. This duo has such a special place in my heart so to hear what might be my favorite record from them since their self-titled has made my day"},{"albumName":"Nymph","artist":"Shygirl","coverPath":"covers\\Shygirl.png","coverURL":"http:\/\/coverartarchive.org\/release\/9313da53-652c-4ea1-9725-639483e676f4\/33429763120.jpg","coverID":"33429763120","releaseid":"9313da53-652c-4ea1-9725-639483e676f4","success":"yes","genre":"Dance\/Electronic","rating":"love","thoughts":"around this time of year I'm usually just like slugging through albums trying to catch all the ones I missed from this year before the year ends and it can get kind of monotonous but this album brought me back to life. I'm so glad I caught it. Production amazing. So many bangers. I had never listened to this artist before this album and now I know that was disrespectful of me."},{"albumName":"PAINLESS","artist":"Nilufer Yanya","coverPath":"covers\\Nilufer Yanya.png","coverURL":"http:\/\/coverartarchive.org\/release\/203bab0e-5f8c-40a8-8fdf-86e478698cbb\/31916349802.jpg","coverID":"31916349802","releaseid":"203bab0e-5f8c-40a8-8fdf-86e478698cbb","success":"yes","genre":"Rock","rating":"love","thoughts":"This is my first time listening to this artist and yeah she blew me out of the fuckign water. It's like soft indie bedroom rock? Is that a genre? I really like the instrumentation and production of every single track, even if it lacks a bit of the stellar quality that obviously bigger artists will have, I think Yanya has absolutely struck the sweet spot with crafting her sound around her voice and her musical style. Love love this album."},{"albumName":"PINK VENMO","artist":"Blackpink","coverPath":"","coverURL":"","coverID":"","releaseid":"","success":"no","genre":"Global, Pop","rating":"eh","thoughts":"Y'all are not gonna like this but this album just was not it. I went into it expecting the boss bitch K-pop album of my DREAMS and instead got whatever this was. It feels like they are trying to Americanize K-pop which is THE EXACT OPPOSITE of why K-pop is so good. The rapping was just like so incorrect. Don’t get me wrong there are some good moments, the pink venom hook is literally chefs kiss but then there are so many parts that just lack flavor. I really wanted this album to be like the \"bad girls\" of K-pop but idk why they think it achieve that they have to lean into western styles, because they don’t even pull it off. Like western standards of \"bad girl\" and k-pop standards of \"bad girl\" are not the same, so it just feels like a bunch of lost Korean girls and their American friend who is super cool in Korea but has a white consultant boyfriend of 5 years back in the states"},{"albumName":"PLAYGIRL","artist":"Lolo Zouai","coverPath":"covers\\Lolo Zouai.png","coverURL":"http:\/\/coverartarchive.org\/release\/1203d9c5-935e-46e2-9987-b65a6f93ca8c\/33582745245.jpg","coverID":"33582745245","releaseid":"1203d9c5-935e-46e2-9987-b65a6f93ca8c","success":"yes","genre":"Pop","rating":"fine","thoughts":"like the girl knows how to drop a banger but literally nothing else. this album is a hot mess with some very decent tracks sprinkled in."},{"albumName":"Palaces","artist":"Flume","coverPath":"covers\\Flume.png","coverURL":"http:\/\/coverartarchive.org\/release\/aa2af143-5ddf-4d06-b474-50c41acee1a6\/32794499247.jpg","coverID":"32794499247","releaseid":"aa2af143-5ddf-4d06-b474-50c41acee1a6","success":"yes","genre":"Dance\/Electronics","rating":"love","thoughts":"Very flume-y. It's a great album. I don't think it's legendary but I like every track."},{"albumName":"Palomino","artist":"Miranda Lambert","coverPath":"covers\\Miranda Lambert.png","coverURL":"http:\/\/coverartarchive.org\/release\/b857ebe8-c391-4504-aa10-46d2c78faa1c\/32084516454.jpg","coverID":"32084516454","releaseid":"b857ebe8-c391-4504-aa10-46d2c78faa1c","success":"yes","genre":"Global","rating":"eh","thoughts":"I just wanted this album to be so much more fun than it was. It definitely had its moments but ultimately I was kinda let underwhelmed. I feel like miss Lambert is losing her edge"},{"albumName":"Physical Thrills","artist":"Silversun Pickups","coverPath":"covers\\Silversun Pickups.png","coverURL":"http:\/\/coverartarchive.org\/release\/751e013b-0a3e-4266-9ac7-6ca86465a845\/33119687609.jpg","coverID":"33119687609","releaseid":"751e013b-0a3e-4266-9ac7-6ca86465a845","success":"yes","genre":"Rock","rating":"love","thoughts":"I think the Silversun Pickups should sleep easy knowing that they were behind one of the most timeless, undisputable classics of any human who in 2010 was both between 13-18 and going through a grunge phase. This album is fine, but it's like, Lazy Eye is really all I needed from this band. And I know it's not going to happen again. That's like lightning striking the same spot twice. This album was hardly lightning. It was like a rumbly storm.Where you're like \"oh cool a storm\" but then it never really grows into anything bigger so you just go about your day without thinking twice about the storm. Idk why I'm waxing poetic about a very forgettable album. ok bye"},{"albumName":"Pink Songs 2","artist":"Sipper","coverPath":"covers\\Sipper.png","coverURL":"http:\/\/coverartarchive.org\/release\/40cb7364-912f-4733-a1f8-0f614985165e\/33770690862.jpg","coverID":"33770690862","releaseid":"40cb7364-912f-4733-a1f8-0f614985165e","success":"yes","genre":"Rock","rating":"love","thoughts":"I love this album, Sipper is kind of a random artist and the vibe is like semi-shitty lofi but that's what makes it so great"},{"albumName":"Plex","artist":"Fazer","coverPath":"covers\\Fazer.png","coverURL":"http:\/\/coverartarchive.org\/release\/f8c49bca-0cc6-417e-86d2-61abfbcf5d66\/31767179508.jpg","coverID":"31767179508","releaseid":"f8c49bca-0cc6-417e-86d2-61abfbcf5d66","success":"yes","genre":"Jazz\/Funk","rating":"fine","thoughts":"i mean it's a jazz funk album, not much more to it"},{"albumName":"Pool Kids","artist":"Pool Kids","coverPath":"covers\\Pool Kids.png","coverURL":"http:\/\/coverartarchive.org\/release\/f2f8bac8-434e-425f-a1fe-4ab7a10568fc\/33538339841.jpg","coverID":"33538339841","releaseid":"f2f8bac8-434e-425f-a1fe-4ab7a10568fc","success":"yes","genre":"Rock","rating":"love","thoughts":"I love this album. This takes me back to like champaign house show days and how much I wish that now as an older child I could see people my age playing really sick math rock and shit. Like I would love to see this guys live. And also 50% female band, vocalist is amazing, some really cool riffs and musical ideas that feel fresh but still have that really nice classic math\/emo influence. Man this is a great breakout album for what seems like just a group of kids from Florida and I'm really happy for them and also happy for me that I found it"},{"albumName":"RENAISSANCE","artist":"Beyonce","coverPath":"covers\\Beyonce.png","coverURL":"http:\/\/coverartarchive.org\/release\/3d3b6aac-50a5-4c98-873a-0fb503869e0e\/33166089225.png","coverID":"33166089225","releaseid":"3d3b6aac-50a5-4c98-873a-0fb503869e0e","success":"yes","genre":"Dance\/Electronic, Hip-Hop","rating":"love","thoughts":"there's not a lot I can say about this album that hasn't already been said. I think at first I was kinda jarred by the style change but then once you're like in it you're like IN IT. I think this is the most logical and well executed evolution of Beyonce's sound that could have possible happened."},{"albumName":"RTJ CU4TRO","artist":"Run The Jewels","coverPath":"covers\\Run The Jewels.png","coverURL":"http:\/\/coverartarchive.org\/release\/c5d64d7c-b69b-45ef-b38e-047351de47aa\/34063413499.jpg","coverID":"34063413499","releaseid":"c5d64d7c-b69b-45ef-b38e-047351de47aa","success":"yes","genre":"Rap, Global","rating":"love","thoughts":"I know this i sjust a remix album but holy shit everything goes so hard? Amazing. Bangers after bangers."},{"albumName":"SMITHEREENS","artist":"Joji","coverPath":"covers\\Joji.png","coverURL":"http:\/\/coverartarchive.org\/release\/45cfff65-0808-45a7-a087-a536a1af1f5e\/33435049081.jpg","coverID":"33435049081","releaseid":"45cfff65-0808-45a7-a087-a536a1af1f5e","success":"yes","genre":"Pop","rating":"eh","thoughts":"This album is too much like angsty emo tik tok music. love joji's vocals tho"},{"albumName":"SOS","artist":"SZA","coverPath":"covers\\SZA.png","coverURL":"http:\/\/coverartarchive.org\/release\/4e41fd97-eb16-455e-bcc3-8b867b7b84f0\/34308497680.jpg","coverID":"34308497680","releaseid":"4e41fd97-eb16-455e-bcc3-8b867b7b84f0","success":"yes","genre":"R&B","rating":"love","thoughts":""},{"albumName":"Sexy","artist":"Coco & Clair Clair","coverPath":"covers\\Coco & Clair Clair.png","coverURL":"http:\/\/coverartarchive.org\/release\/c27f87a4-7c18-44a6-9720-befff67a0496\/34030752316.jpg","coverID":"34030752316","releaseid":"c27f87a4-7c18-44a6-9720-befff67a0496","success":"yes","genre":"R&B","rating":"no.","thoughts":"The beats are really cool but the bars are SO BAD and I can't tell if it's supposed to be like campy and ironic or? They're just like so distractingly bad"},{"albumName":"Shape Up","artist":"Leikeli47","coverPath":"covers\\Leikeli47.png","coverURL":"http:\/\/coverartarchive.org\/release\/d93b809f-3281-43e1-bfdc-9d138643b586\/32524480980.jpg","coverID":"32524480980","releaseid":"d93b809f-3281-43e1-bfdc-9d138643b586","success":"yes","genre":"Rap","rating":"love","thoughts":"Okay this is so fresh after having listened to the kota album. Obviously they are very different styles of rap but this album is so much more visionary"},{"albumName":"Shoals","artist":"Palace","coverPath":"covers\\Palace.png","coverURL":"http:\/\/coverartarchive.org\/release\/b3dd2273-d680-46c2-b555-9ab32b819b51\/31524220767.jpg","coverID":"31524220767","releaseid":"b3dd2273-d680-46c2-b555-9ab32b819b51","success":"yes","genre":"Rock","rating":"eh","thoughts":"idk kind of forgettable. it was fine."},{"albumName":"Sick!","artist":"Earl Sweatshirt","coverPath":"covers\\Earl Sweatshirt.png","coverURL":"http:\/\/coverartarchive.org\/release\/97286f4e-0673-40a3-92e3-032079801fe8\/31263867138.jpg","coverID":"31263867138","releaseid":"97286f4e-0673-40a3-92e3-032079801fe8","success":"yes","genre":"Rap","rating":"like","thoughts":"This is a short album that's pretty tight, every beat is good and earls flow is nice but the album feels a little eclectic. I didn't listen too hard to the lyrics but musically it didn't feel very cohesive. I also don’t feel Like anything earl does here is very groundbreaking. His die hard fans will be happy but this being this first earl album I listen to I feel a little underwhelmed"},{"albumName":"Sometimes, Forever","artist":"Soccer Mommy","coverPath":"covers\\Soccer Mommy.png","coverURL":"http:\/\/coverartarchive.org\/release\/56da68db-e582-4924-9ed6-4a522d12a569\/34010450946.jpg","coverID":"34010450946","releaseid":"56da68db-e582-4924-9ed6-4a522d12a569","success":"yes","genre":"Rock","rating":"love","thoughts":"Soccer Mommy, despite having one of my least favorite artist names ever, has always captured my attention for the grunge-chill-rock niche she fills, especially as a female artist. This album feels like an even darker turn from her previous work, but I think the shift lands well. I think each song kinda sounds the same up to a certain point, and I can't tell how much of that is just emblematic of her style or maybe a symptom of the dark grunge vibe feeling a little restricting to her creativity. That said, there are no skips and I think it contributes to a cohesiveness in style and theme to the album that I ultimately really enjoyed"},{"albumName":"Sore Thumb","artist":"Oso Oso","coverPath":"covers\\Oso Oso.png","coverURL":"http:\/\/coverartarchive.org\/release\/bf72a567-e1a8-435c-8ef7-058955a9a6c0\/32024600354.jpg","coverID":"32024600354","releaseid":"bf72a567-e1a8-435c-8ef7-058955a9a6c0","success":"yes","genre":"Rock","rating":"love","thoughts":""},{"albumName":"Soul Sold Separately","artist":"Freddie Gibbs","coverPath":"covers\\Freddie Gibbs.png","coverURL":"","coverID":"","releaseid":"","success":"yes - manual","genre":"Rap","rating":"like","thoughts":"Yeah this is a cool album. I don't feel strongly about it but def some saves"},{"albumName":"Special","artist":"Lizzo","coverPath":"covers\\Lizzo.png","coverURL":"http:\/\/coverartarchive.org\/release\/f1959099-e727-40df-b740-be054ecaf350\/34320701882.jpg","coverID":"34320701882","releaseid":"f1959099-e727-40df-b740-be054ecaf350","success":"yes","genre":"Pop","rating":"like","thoughts":"This is such a fun album that I don't think smashes any formulas, but it makes you feel so warm and happy inside in a way that not a single album I've listened to so far has been able to achieve. It's such a beautiful testament to joy and self-love and growth neatly packaged in like the most danceable head-boppy tracks. Also just the fact that she is a fat, black woman making music about unapolagetically loving herself and the world around her is already formula smashing in the most necessary and important way. Lizzo is just so great and I'm so glad she is an icon for our generation!"},{"albumName":"Spell 31","artist":"Ibeyi","coverPath":"covers\\Ibeyi.png","coverURL":"http:\/\/coverartarchive.org\/release\/08cc1af6-7293-4fe6-8f2f-510fa51589e7\/31851571218.jpg","coverID":"31851571218","releaseid":"08cc1af6-7293-4fe6-8f2f-510fa51589e7","success":"yes","genre":"Global","rating":"like","thoughts":""},{"albumName":"Storm Queen","artist":"Grace Cummings","coverPath":"covers\\Grace Cummings.png","coverURL":"http:\/\/coverartarchive.org\/release\/1b5c6239-99b4-4b23-af50-75cc95fd9eff\/31552569424.jpg","coverID":"31552569424","releaseid":"1b5c6239-99b4-4b23-af50-75cc95fd9eff","success":"yes","genre":"Folk","rating":"fine","thoughts":"Made me feel like I've seen things"},{"albumName":"Surrender","artist":"Maggie Rogers","coverPath":"covers\\Maggie Rogers.png","coverURL":"http:\/\/coverartarchive.org\/release\/b92faf86-1eed-450f-b12c-e546ecc76b61\/34069454207.jpg","coverID":"34069454207","releaseid":"b92faf86-1eed-450f-b12c-e546ecc76b61","success":"yes","genre":"Pop","rating":"love","thoughts":"I listened to this and then I watched that video of Maggie rogers and Pharrell and then I listened to it again and it was definitely better the second time around. There are some great tracks, that said I feel like the things I saw in that video and in that first listen of Alaska are kind of lost in this album. I wonder if I expected too much of Maggie Rogers, like it has kind of lost the folk influences that were so prominent in Alaska and it sounds a little more like classic indie pop. Whatever, it's a good album!"},{"albumName":"THE UNRAVELING OF PUPTHEBAND","artist":"PUP","coverPath":"covers\\PUP.png","coverURL":"http:\/\/coverartarchive.org\/release\/713195a2-105b-4dad-824a-57bbce6156c9\/31507128250.jpg","coverID":"31507128250","releaseid":"713195a2-105b-4dad-824a-57bbce6156c9","success":"yes","genre":"Rock","rating":"love","thoughts":"Really liked this, even if it was a little more 'noise' than I normally gravitate towards. There were def some bangers but I also liked the thread of the entire project throughout. v cool"},{"albumName":"TM","artist":"brockhampton","coverPath":"covers\\brockhampton.png","coverURL":"http:\/\/coverartarchive.org\/release\/28edd186-1646-48f7-a158-b90615fc9fc4\/34116387073.jpg","coverID":"34116387073","releaseid":"28edd186-1646-48f7-a158-b90615fc9fc4","success":"yes","genre":"Rap","rating":"like","thoughts":"Yeah this was the final bh album I was expecting. It's not my fave of theirs but there are def some bangers (Man on the moon is def making top songs of 2022). Am genuinely sad to see this group disband but sounds like it was for the best. Again, this won't be the album I go back to for when I'm feeling nostalgic for some brockhampton, but I do think it was a really beautiful parting gift to their fans, especially given it's surprise drop after The Family"},{"albumName":"TRAP CAKE VOL. 2","artist":"Rauw Alejandro","coverPath":"covers\\Rauw Alejandro.png","coverURL":"http:\/\/coverartarchive.org\/release\/87ffc465-f8c2-4dc8-9450-b7ca765e70ee\/31832741116.jpg","coverID":"31832741116","releaseid":"87ffc465-f8c2-4dc8-9450-b7ca765e70ee","success":"yes","genre":"Rap","rating":"like","thoughts":"This is a fun album, and I think it's intentionally not meant to be anything overtly profound or game changing, which definitely shows. But I respect an artist that can drop something just to have some fun and mess around, which is what I think a lot of this album is based on the leaning into american rap\/trap for an artist who is so known in the latin, reggaeton dominated music scenes. That said, I think he really pulls off weaving between genres here and the moments where he does incorporate some of his reggaeton influence feel really well done. Some nice features too. I like Rauw Alejandro, he's not exactly reggaeton king anyways and I respect his ability to toe the line of different genres. But again, not a whole lot more than a fun album, and some tracks definitely flop or feel tired"},{"albumName":"The Dream","artist":"Alt-J","coverPath":"covers\\Alt-J.png","coverURL":"http:\/\/coverartarchive.org\/release\/071e7147-3f15-4368-972b-d39c0b51c057\/31707454140.jpg","coverID":"31707454140","releaseid":"071e7147-3f15-4368-972b-d39c0b51c057","success":"yes","genre":"","rating":"","thoughts":""},{"albumName":"The Family","artist":"brockhampton","coverPath":"","coverURL":"","coverID":"","releaseid":"","success":"no","genre":"Rap","rating":"eh","thoughts":"Yeah so this album I think is like a diary confession to all the die-hard brockhampton friends, so I think the bulk of its value is sentimental. based on the album i think there was a lot of politics going on about the bands 'last' album with respect to their record label and it feels like the band needed to check a box, and so kevin abstract was like 'ok might as well like just fuck around and spill all my thoughts and feelings about the band for 35 minutes'. which, again, is likely very cathartic if you are a huge bh fan, but I am not, so I was kinda like meh about it."},{"albumName":"The Forever Story","artist":"JID","coverPath":"covers\\JID.png","coverURL":"http:\/\/coverartarchive.org\/release\/6acf7bd3-182f-4dcf-8f8b-ec728546b3e2\/33407350344.jpg","coverID":"33407350344","releaseid":"6acf7bd3-182f-4dcf-8f8b-ec728546b3e2","success":"yes","genre":"Rap","rating":"love","thoughts":"Yeah this album is dope as fuck. I mean I don't think it's as game changing as some people are saying it is, but I think for JID it will be a huge catalyst in his career as an artist. Money is the duddiest dud of this year tho. Other than that some real bangers"},{"albumName":"The Loneliest Time","artist":"Carly Rae Jepsen","coverPath":"covers\\Carly Rae Jepsen.png","coverURL":"","coverID":"","releaseid":"d000ac96-2edb-41cd-aeda-6d0151288503","success":"yes - manual","genre":"Pop","rating":"no.","thoughts":"this album was essentially 14 different call me maybe's and 3 ballads"},{"albumName":"Things Are Great","artist":"Band of Horses","coverPath":"covers\\Band of Horses.png","coverURL":"http:\/\/coverartarchive.org\/release\/002276e8-35e4-4811-97b7-80e765b5e0d0\/31890914734.jpg","coverID":"31890914734","releaseid":"002276e8-35e4-4811-97b7-80e765b5e0d0","success":"yes","genre":"Rock, Folk","rating":"eh","thoughts":"no standout tracks tbh."},{"albumName":"Three Dimensions Deep","artist":"Amber Mark","coverPath":"covers\\Amber Mark.png","coverURL":"http:\/\/coverartarchive.org\/release\/ff20c8ef-3c13-4a4c-93b8-42454fecfe5d\/31581790564.jpg","coverID":"31581790564","releaseid":"ff20c8ef-3c13-4a4c-93b8-42454fecfe5d","success":"yes","genre":"Pop, R&B","rating":"love","thoughts":"amazing breakout album, love the vibe she's going for. Very Teyana Taylor-y but honestly fresher. Great album, no skips."},{"albumName":"Traumazine","artist":"Megan thee Stallion","coverPath":"covers\\Megan thee Stallion.png","coverURL":"http:\/\/coverartarchive.org\/release\/8ff22e4e-a009-4e57-ae1f-875209a6ad03\/33275179435.jpg","coverID":"33275179435","releaseid":"8ff22e4e-a009-4e57-ae1f-875209a6ad03","success":"yes","genre":"Rap","rating":"love","thoughts":"This album is such a contrast to Good News but I LOVE ITTTT exactly for that reason! Like I liked Good News, it was fun and full of energy but I think Meg being able to so effortlessly and tangibly switch her style and her ethos on this album is part of what makes her great. This album is more agressive, it bites back, and it's honestly what I needed to hear from a rapper that has recently felt like such an industry pushover at times. SWEETEST PIE IS ASS THOUGH that track does not belong on this album at all I fucking hate it and I'm not even mad at Meg for it I know that was just so fucking industry label producers forcing her to throw her cheap ass commercial money-making track on an album that was otherwise so cohesive and personal and tight. Its like Meg can't have one thing to herself can she. God damn."},{"albumName":"Triple Trey","artist":"Butcher Brown","coverPath":"covers\\Butcher Brown.png","coverURL":"http:\/\/coverartarchive.org\/release\/dcaa8f24-d6ca-4a25-996c-d3099b24c1f0\/33148899243.jpg","coverID":"33148899243","releaseid":"dcaa8f24-d6ca-4a25-996c-d3099b24c1f0","success":"yes","genre":"Jazz\/Funk, Rap","rating":"love","thoughts":"You know as I'm reflecting i don't think this album was anything spectacular but it's such so smooth and groovy. I love Butcher Brown's sound and they are really honing in on it here, maybe at the expense of not doing anything too new or groundbreaking. Either way I really enjoyed this and I think what they are doing isn't found in a lot of other artists right now"},{"albumName":"Un Verano Sin Ti","artist":"Bad Bunny","coverPath":"covers\\Bad Bunny.png","coverURL":"http:\/\/coverartarchive.org\/release\/aded3f90-b758-451a-aad7-711d5985b05f\/32432776461.jpg","coverID":"32432776461","releaseid":"aded3f90-b758-451a-aad7-711d5985b05f","success":"yes","genre":"Global, Rap","rating":"love","thoughts":"I mean not to be basic as fuck but yeah this album is just full of bangers. That said there are a lot of skips, like the mans did not need 30 tracks. But yeah there are so many anthems in this album, the production is awesome, BB is just flexing the fuck out of is rage here while still holding on to his reggaton roots."},{"albumName":"WE","artist":"Arcade Fire","coverPath":"covers\\Arcade Fire.png","coverURL":"http:\/\/coverartarchive.org\/release\/7fa9fcd3-1eb3-4928-9215-2d508e4e4cac\/32498226867.jpg","coverID":"32498226867","releaseid":"7fa9fcd3-1eb3-4928-9215-2d508e4e4cac","success":"yes","genre":"Rock","rating":"like","thoughts":"a good healthy classic no frills dose of arcade fire. never hurt nobody. good for the soul, some might say"},{"albumName":"We're Here my Dear","artist":"Ging","coverPath":"covers\\Ging.png","coverURL":"http:\/\/coverartarchive.org\/release\/8c7be614-0341-4716-900a-e9f1aaf501d2\/34279866755.jpg","coverID":"34279866755","releaseid":"8c7be614-0341-4716-900a-e9f1aaf501d2","success":"yes","genre":"Rock, Folk\/Acoustic","rating":"fine","thoughts":"This is my first album by this artist! I think it is fine. A little underwhelming but there were some saves. The best songs had some more upbeat indie-rock-esque break downs but too many tracks were downtempo indie crooning and unless you're like Sufjan or phoebe level you just can't play into that so much"},{"albumName":"Wet Leg","artist":"Wet Leg","coverPath":"covers\\Wet Leg.png","coverURL":"http:\/\/coverartarchive.org\/release\/949c1b3a-db54-4302-90b3-ec8d0f70a45b\/31068515683.jpg","coverID":"31068515683","releaseid":"949c1b3a-db54-4302-90b3-ec8d0f70a45b","success":"yes","genre":"Rock","rating":"love","thoughts":"this album is fucking amazing sorry I don't have anything profound to say I just am so excited about this album as a fucking breakout album! I love wet leg I think their style and aesthetic is exactly what I want out of the indie rock sphere and i'm just so in love with the album. It's the kind of project that makes you wanna be best friends with the artists behind it"},{"albumName":"What Had Happend Was...","artist":"DRAM","coverPath":"","coverURL":"","coverID":"","releaseid":"","success":"no","genre":"R&B","rating":"fine","thoughts":"I didn't give this album enough attention I think but also I should accept that I just am not a huge fan of R&B lol"},{"albumName":"Will of the People","artist":"Muse","coverPath":"covers\\Muse.png","coverURL":"http:\/\/coverartarchive.org\/release\/08950fa1-c793-4b8d-8406-f9ab41b5b0d9\/32658272475.jpg","coverID":"32658272475","releaseid":"08950fa1-c793-4b8d-8406-f9ab41b5b0d9","success":"yes","genre":"Rock","rating":"no.","thoughts":"feels like a Queen wannabe album"},{"albumName":"World Wide Pop","artist":"Superorganism","coverPath":"covers\\Superorganism.png","coverURL":"http:\/\/coverartarchive.org\/release\/1ad2d613-68bc-4cc7-9dd2-3fbae843e428\/32450075330.png","coverID":"32450075330","releaseid":"1ad2d613-68bc-4cc7-9dd2-3fbae843e428","success":"yes","genre":"Pop","rating":"like","thoughts":"I mean I knew what I was getting into with a Superorganism album. They're as wacky and weird and funky as ever, I think sometimes it goes a little over my head but there are a lot of genuinely fun and vibey and even heartfelt moments on this album. It's a good time! put down your phone makes me want to scream though. I don't want another \"We'Re AdDiCtEd To oUr sMArTpHoNeS!\" anthem. like i know. please leave me alone."},{"albumName":"You Can't Kill Me","artist":"070 Shake","coverPath":"covers\\070 Shake.png","coverURL":"http:\/\/coverartarchive.org\/release\/9b2a3679-718d-486d-af63-baeb6615cfed\/33001331180.jpg","coverID":"33001331180","releaseid":"9b2a3679-718d-486d-af63-baeb6615cfed","success":"yes","genre":"Pop","rating":"love","thoughts":"For whatever reason I didn't really fuck w 070 Shake's last project but this one really got me. It's just so fucking cool, she's just so cool"},{"albumName":"You Still Here, Ho?","artist":"Flo Milli","coverPath":"covers\\Flo Milli.png","coverURL":"http:\/\/coverartarchive.org\/release\/1b76fc74-88da-443f-bf46-07a8d31786d3\/33097017368.jpg","coverID":"33097017368","releaseid":"1b76fc74-88da-443f-bf46-07a8d31786d3","success":"yes","genre":"Rap","rating":"like","thoughts":"god i could write a thesis about the way this album disappointed me. Flo Milli came onto the scene with such momentum after 'Ho why is you here?', and it feels like she absolutely wasted it with this album. It feels super lost, and is generally underwhelming for a rapper who not a few years ago was able to produce such a tight, hype, no-skips mixtape. I was looking for Flo to evolve-- she'd established herself as that bitch, as better than you, as mrs steal-your-man with ho why is you here, so having the first track on this album being completely about fighting bitches in the street feels like a weird way to set up her next phase as the 'princess' of rap. The album feels completely lost, and while a couple of tracks do pay homage to her hard-hitting, high energy bravado flow (i.e. Big Steppa, No Face), her attempts at stepping outside of her comfort zone with dance hall track PBC and the R&B vibes of Tilted Halo (an INSANE choice for the last 'official' track of the album) completely fall short. Flo Milli gave herself big shoes to fill, and she didn't rise up to the challenge with You Still Here, Ho. It's certainly not for lack of talent, because there are still so many glimmering moments of what made Flo so fresh and exciting for me when I first heard her. It seems more like she just didn't have the support or direction to develop her sound. You Still Here, Ho is full of shitty beats, the least catchiest hooks you've ever heard, tired refrains of the same ideas, and general disappointment."},{"albumName":"age\/sex\/location","artist":"Ari Lennox","coverPath":"covers\\Ari Lennox.png","coverURL":"http:\/\/coverartarchive.org\/release\/caa7f262-0341-4794-8280-6506053d27c5\/33746048046.jpg","coverID":"33746048046","releaseid":"caa7f262-0341-4794-8280-6506053d27c5","success":"yes","genre":"R&B","rating":"","thoughts":"I think I just don't like R&B? Unless it's Jasmine Sullivan? I don't think i am equipped to speak on this album"},{"albumName":"crybaby","artist":"Tegan and Sara","coverPath":"covers\\Tegan and Sara.png","coverURL":"http:\/\/coverartarchive.org\/release\/a70f8c3c-d156-4bd4-94ab-c88ef343f4e8\/33891301925.jpg","coverID":"33891301925","releaseid":"a70f8c3c-d156-4bd4-94ab-c88ef343f4e8","success":"yes","genre":"Pop","rating":"","thoughts":""}]